{"pageProps":{"note":{"id":"8ElFvQBDYuPdyHJeLaRNS","title":"Scientific_paper","desc":"","updated":1724861585527,"created":1601410082237,"custom":{},"fname":"writing.scientific_paper","type":"note","vault":{"fsPath":"vault"},"contentHash":"a8ffffab07757300cf2b40b98c614a00","links":[{"from":{"id":"jw21bshi0z4fd96sselk09w","fname":"open-notebook.commons.mvisani.2024.03.08","vaultName":"vault"},"type":"backlink","position":{"start":{"line":12,"column":5,"offset":225},"end":{"line":12,"column":33,"offset":253},"indent":[]},"value":"writing.scientific_paper"}],"anchors":{"scientific-papers":{"type":"header","text":"Scientific Papers","value":"scientific-papers","line":8,"column":0,"depth":1},"the-introduction":{"type":"header","text":"The introduction","value":"the-introduction","line":28,"column":0,"depth":2},"context-and-need":{"type":"header","text":"Context and need","value":"context-and-need","line":40,"column":0,"depth":3},"task-and-object":{"type":"header","text":"Task and object","value":"task-and-object","line":56,"column":0,"depth":3},"materials-and-methods":{"type":"header","text":"Materials and methods","value":"materials-and-methods","line":124,"column":0,"depth":2},"results-and-discussion":{"type":"header","text":"Results and discussion","value":"results-and-discussion","line":130,"column":0,"depth":2},"the-conclusion":{"type":"header","text":"The conclusion","value":"the-conclusion","line":137,"column":0,"depth":2},"the-abstract":{"type":"header","text":"The abstract","value":"the-abstract","line":146,"column":0,"depth":2},"snippet":{"type":"header","text":"Snippet","value":"snippet","line":163,"column":0,"depth":2},"title":{"type":"header","text":"Title","value":"title","line":167,"column":0,"depth":1},"context-of-the-paperdocnoteparagraph":{"type":"header","text":"Context (of the paper/doc/note/paragraph)","value":"context-of-the-paperdocnoteparagraph","line":169,"column":0,"depth":2},"need-of-the-paperdocnoteparagraph":{"type":"header","text":"Need (of the paper/doc/note/paragraph)","value":"need-of-the-paperdocnoteparagraph","line":171,"column":0,"depth":2},"task-of-the-paperdocnoteparagraph":{"type":"header","text":"Task (of the paper/doc/note/paragraph)","value":"task-of-the-paperdocnoteparagraph","line":173,"column":0,"depth":2},"object-of-the-paperdocnoteparagraph":{"type":"header","text":"Object (of the paper/doc/note/paragraph)","value":"object-of-the-paperdocnoteparagraph","line":175,"column":0,"depth":2},"title-1":{"type":"header","text":"Title","value":"title-1","line":179,"column":0,"depth":1},"context":{"type":"header","text":"Context","value":"context","line":181,"column":0,"depth":2},"need":{"type":"header","text":"Need","value":"need","line":183,"column":0,"depth":2},"task-of-the-noteparagraphtextpaperproject":{"type":"header","text":"Task (of the note/paragraph/text/paper/project)","value":"task-of-the-noteparagraphtextpaperproject","line":185,"column":0,"depth":2},"object-of-the-noteparagraphtextpaperproject":{"type":"header","text":"Object (of the note/paragraph/text/paper/project)","value":"object-of-the-noteparagraphtextpaperproject","line":190,"column":0,"depth":2}},"children":[],"parent":"q1yxhdq1jqazej8hq8qzqrb","data":{}},"body":"<h1 id=\"scientific_paper\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#scientific_paper\"></a>Scientific_paper</h1>\n<h1 id=\"scientific-papers\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#scientific-papers\"></a>Scientific Papers</h1>\n<p>(<a href=\"https://www.nature.com/scitable/topicpage/scientific-papers-13815490/\">https://www.nature.com/scitable/topicpage/scientific-papers-13815490/</a>)</p>\n<p>Scientific papers are for sharing your own original research work with other scientists or for reviewing the research conducted by others. As such, they are critical to the evolution of modern science, in which the work of one scientist builds upon that of others. To reach their goal, papers must aim to inform, not impress. They must be highly readable — that is, clear, accurate, and concise. They are more likely to be cited by other scientists if they are helpful rather than cryptic or self-centered.</p>\n<p>Scientific papers typically have two audiences: first, the referees, who help the journal editor decide whether a paper is suitable for publication; and second, the journal readers themselves, who may be more or less knowledgeable about the topic addressed in the paper. To be accepted by referees and cited by readers, papers must do more than simply present a chronological account of the research work. Rather, they must convince their audience that the research presented is important, valid, and relevant to other scientists in the same field. To this end, they must emphasize both the motivation for the work and the outcome of it, and they must include just enough evidence to establish the validity of this outcome.</p>\n<p>Papers that report experimental work are often structured chronologically in five sections: first, Introduction; then Materials and Methods, Results, and Discussion (together, these three sections make up the paper's body); and finally, Conclusion.</p>\n<p>The Introduction section clarifies the motivation for the work presented and prepares readers for the structure of the paper.\nThe Materials and Methods section provides sufficient detail for other scientists to reproduce the experiments presented in the paper. In some journals, this information is placed in an appendix, because it is not what most readers want to know first.\nThe Results and Discussion sections present and discuss the research results, respectively. They are often usefully combined into one section, however, because readers can seldom make sense of results alone without accompanying interpretation — they need to be told what the results mean.\nThe Conclusion section presents the outcome of the work by interpreting the findings at a higher level of abstraction than the Discussion and by relating these findings to the motivation stated in the Introduction.\n(Papers reporting something other than experiments, such as a new method or technology, typically have different sections in their body, but they include the same Introduction and Conclusion sections as described above.)</p>\n<p>Although the above structure reflects the progression of most research projects, effective papers typically break the chronology in at least three ways to present their content in the order in which the audience will most likely want to read it. First and foremost, they summarize the motivation for, and the outcome of, the work in an abstract, located before the Introduction. In a sense, they reveal the beginning and end of the story — briefly — before providing the full story. Second, they move the more detailed, less important parts of the body to the end of the paper in one or more appendices so that these parts do not stand in the readers' way. Finally, they structure the content in the body in theorem-proof fashion, stating first what readers must remember (for example, as the first sentence of a paragraph) and then presenting evidence to support this statement.</p>\n<h2 id=\"the-introduction\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#the-introduction\"></a>The introduction</h2>\n<p> View Full-Size Image An effective introduction for a paper</p>\n<p>The introduction reproduced here exhibits the four components that readers find useful as they begin to read a paper.\nIn the Introduction section, state the motivation for the work presented in your paper and prepare readers for the structure of the paper. Write four components, probably (but not necessarily) in four paragraphs: context, need, task, and object of the document.</p>\n<ul>\n<li>First, provide some context to orient those readers who are less familiar with your topic and to establish the importance of your work.</li>\n<li>Second, state the need for your work, as an opposition between what the scientific community currently has and what it wants.</li>\n<li>Third, indicate what you have done in an effort to address the need (this is the task).</li>\n<li>Finally, preview the remainder of the paper to mentally prepare readers for its structure, in the object of the document.</li>\n</ul>\n<h3 id=\"context-and-need\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#context-and-need\"></a>Context and need</h3>\n<p>At the beginning of the Introduction section, the context and need work together as a funnel: They start broad and progressively narrow down to the issue addressed in the paper. To spark interest among your audience — referees and journal readers alike — provide a compelling motivation for the work presented in your paper: The fact that a phenomenon has never been studied before is not, in and of itself, a reason to study that phenomenon.</p>\n<p>Write the context in a way that appeals to a broad range of readers and leads into the need. Do not include context for the sake of including context: Rather, provide only what will help readers better understand the need and, especially, its importance. Consider anchoring the context in time, using phrases such as recently, in the past 10 years, or since the early 1990s. You may also want to anchor your context in space (either geographically or within a given research field).</p>\n<p>Convey the need for the work as an opposition between actual and desired situations. Start by stating the actual situation (what we have) as a direct continuation of the context. If you feel you must explain recent achievements in much detail — say, in more than one or two paragraphs — consider moving the details to a section titled State of the art (or something similar) after the Introduction, but do provide a brief idea of the actual situation in the Introduction. Next, state the desired situation (what we want). Emphasize the contrast between the actual and desired situations with such words as but, however, or unfortunately.</p>\n<p>One elegant way to express the desired part of the need is to combine it with the task in a single sentence. This sentence expresses first the objective, then the action undertaken to reach this objective, thus creating a strong and elegant connection between need and task. Here are three examples of such a combination:</p>\n<ul>\n<li>\n<p>To confirm this assumption, we studied the effects of a range of inhibitors of connexin channels . . . on . . .</p>\n</li>\n<li>\n<p>To assess whether such multiple-coil sensors perform better than single-signal ones, we tested two of them — the DuoPXK and the GEMM3 — in a field where . . .</p>\n</li>\n<li>\n<p>To form a better view of the global distribution and infectiousness of this pathogen, we examined 1645 postmetamorphic and adult amphibians collected from 27 countries between 1984 and 2006 for the presence of . . .</p>\n</li>\n</ul>\n<h3 id=\"task-and-object\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#task-and-object\"></a>Task and object</h3>\n<p>An Introduction is usually clearer and more logical when it separates what the authors have done (the task) from what the paper itself attempts or covers (the object of the document). In other words, the task clarifies your contribution as a scientist, whereas the object of the document prepares readers for the structure of the paper, thus allowing focused or selective reading.</p>\n<p>For the task,</p>\n<ul>\n<li>use whoever did the work (normally, you and your colleagues) as the subject of the sentence: we or perhaps the authors;</li>\n<li>use a verb expressing a research action: measured, calculated, etc.;</li>\n<li>set that verb in the past tense.</li>\n</ul>\n<p>The three examples below are well-formed tasks.</p>\n<ul>\n<li>\n<p>To confirm this assumption, we studied the effects of a range of inhibitors of connexin channels, such as the connexin mimetic peptides Gap26 and Gap27 and anti-peptide antibodies, on calcium signaling in cardiac cells and HeLa cells expressing connexins.</p>\n</li>\n<li>\n<p>During controlled experiments, we investigated the influence of the HMP boundary conditions on liver flows.</p>\n</li>\n<li>\n<p>To tackle this problem, we developed a new software verification technique called oblivious hashing, which calculates the hash values based on the actual execution of the program.</p>\n</li>\n</ul>\n<p>The list below provides examples of verbs that express research actions:</p>\n<p>apply\nWe applied Laklöter's principle to . . .\nassess\tWe assessed the effects of larger doses of . . .\ncalculate\nWe calculated the photoluminescence spectrum of . . .\ncompare\tWe compared the effects of . . . to those of . . .\ncompute\tWe computed the velocity predicted by . . .\nderive\tWe derived a new set of rules for . . .\ndesign\tWe designed a series of experiments to . . .\ndetermine\tWe determined the complete nucleotide sequence of . . .\ndevelop\tWe developed a new algorithm to . . .\nevaluate\tWe evaluated the efficacy and biocompatibility of . . .\nexplore\tWe explored the relationship between . . .\nimplement\tWe implemented a genetic algorithm for . . .\ninvestigate\tWe investigated the behavior of . . .\nmeasure\tWe measured the concentration of cadmium in . . .\nmodel\tWe modeled the diffraction behavior of . . .\nFor the object of the document,</p>\n<p>use the document itself as the subject of the sentence: this paper, this letter, etc.;\nuse a verb expressing a communication action: presents, summarizes, etc.;\nset the verb in the present tense.\nThe three examples below are suitable objects of the document for the three tasks shown above, respectively.</p>\n<p>This paper clarifies the role of CxHc on calcium oscillations in neonatal cardiac myocytes and calcium transients induced by ATP in HL-cells originated from cardiac atrium and in HeLa cells expressing connexin 43 or 26.</p>\n<p>This paper presents the flow effects induced by increasing the hepatic-artery pressure and by obstructing the vena cava inferior.</p>\n<p>This paper discusses the theory behind oblivious hashing and shows how this approach can be applied for local software tamper resistance and remote code authentication.</p>\n<p>The list below provides examples of verbs that express communication actions:</p>\n<p>clarify\nThis paper clarifies the role of soils in . . .\ndescribe\tThis paper describes the mechanism by which . . .\ndetail\tThis paper details the algorithm used for . . .\ndiscuss\tThis paper discusses the influence of acidity on . . .\nexplain\tThis paper explains how the new encoding scheme . . .\noffer\tThis paper offers four recommendations for . . .\npresent\tThis paper presents the results of . . .\nproposes\tThis paper proposes a set of guidelines for . . .\nprovide\tThis paper provides the complete framework and . . .\nreport\tThis paper reports on our progress so far . . .\nsummarize\tThis paper summarizes our results for 27 patients with . . .\nThe body\nEven the most logical structure is of little use if readers do not see and understand it as they progress through a paper. Thus, as you organize the body of your paper into sections and perhaps subsections, remember to prepare your readers for the structure ahead at all levels. You already do so for the overall structure of the body (the sections) in the object of the document at the end of the Introduction. You can similarly prepare your readers for an upcoming division into subsections by introducing a global paragraph between the heading of a section and the heading of its first subsection. This paragraph can contain any information relating to the section as a whole rather than particular subsections, but it should at least announce the subsections, whether explicitly or implicitly. An explicit preview would be phrased much like the object of the document: \"This section first . . . , then . . . , and finally . . . \"</p>\n<p>Although papers can be organized into sections in many ways, those reporting experimental work typically include Materials and Methods, Results, and Discussion in their body. In any case, the paragraphs in these sections should begin with a topic sentence to prepare readers for their contents, allow selective reading, and — ideally — get a message across.</p>\n<h2 id=\"materials-and-methods\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#materials-and-methods\"></a>Materials and methods</h2>\n<p>This paragraph of materials and methods expresses the main idea first, in a topic sentence, so readers immediately know what it is about.\nMost Materials and Methods sections are boring to read, yet they need not be. To make this section interesting, explain the choices you made in your experimental procedure: What justifies using a given compound, concentration, or dimension? What is special, unexpected, or different in your approach? Mention these things early in your paragraph, ideally in the first sentence. If you use a standard or usual procedure, mention that upfront, too. Do not make readers guess: Make sure the paragraph's first sentence gives them a clear idea of what the entire paragraph is about. If you feel you cannot or need not do more than list items, consider using a table or perhaps a schematic diagram rather than a paragraph of text.</p>\n<h2 id=\"results-and-discussion\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#results-and-discussion\"></a>Results and discussion</h2>\n<p>This paragraph of results and discussion (above) can easily be rewritten (below) to convey the message first, not last.\nThe traditional Results and Discussion sections are best combined because results make little sense to most readers without interpretation.\nWhen reporting and discussing your results, do not force your readers to go through everything you went through in chronological order. Instead, state the message of each paragraph upfront: Convey in the first sentence what you want readers to remember from the paragraph as a whole. Focus on what happened, not on the fact that you observed it. Then develop your message in the remainder of the paragraph, including only that information you think you need to convince your audience.</p>\n<h2 id=\"the-conclusion\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#the-conclusion\"></a>The conclusion</h2>\n<p>This paragraph of results and discussion (above) can easily be rewritten (below) to convey the message first, not last.\nIn the Conclusion section, state the most important outcome of your work. Do not simply summarize the points already made in the body — instead, interpret your findings at a higher level of abstraction. Show whether, or to what extent, you have succeeded in addressing the need stated in the Introduction. At the same time, do not focus on yourself (for example, by restating everything you did). Rather, show what your findings mean to readers. Make the Conclusion interesting and memorable for them.\nAt the end of your Conclusion, consider including perspectives — that is, an idea of what could or should still be done in relation to the issue addressed in the paper. If you include perspectives, clarify whether you are referring to firm plans for yourself and your colleagues (\"In the coming months, we will . . . \") or to an invitation to readers (\"One remaining question is . . . \").</p>\n<p>If your paper includes a well-structured Introduction and an effective abstract, you need not repeat any of the Introduction in the Conclusion. In particular, do not restate what you have done or what the paper does. Instead, focus on what you have found and, especially, on what your findings mean. Do not be afraid to write a short Conclusion section: If you can conclude in just a few sentences given the rich discussion in the body of the paper, then do so. (In other words, resist the temptation to repeat material from the Introduction just to make the Conclusion longer under the false belief that a longer Conclusion will seem more impressive.)</p>\n<h2 id=\"the-abstract\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#the-abstract\"></a>The abstract</h2>\n<p>In just under 200 words, the abstract reproduced here conveys the motivation for and the outcome of the work with some accuracy but without intimidating readers by its length.\nThe readers of a scientific paper read the abstract for two purposes: to decide whether they want to (acquire and) read the full paper, and to prepare themselves for the details presented in that paper. An effective abstract helps readers achieve these two purposes. In particular, because it is typically read before the full paper, the abstract should present what the readers are primarily interested in; that is, what they want to know first of all and most of all.\nTypically, readers are primarily interested in the information presented in a paper's Introduction and Conclusion sections. Primarily, they want to know the motivation for the work presented and the outcome of this work. Then (and only then) the most specialized among them might want to know the details of the work. Thus, an effective abstract focuses on motivation and outcome; in doing so, it parallels the paper's Introduction and Conclusion.</p>\n<p>Accordingly, you can think of an abstract as having two distinct parts — motivation and outcome — even if it is typeset as a single paragraph. For the first part, follow the same structure as the Introduction section of the paper: State the context, the need, the task, and the object of the document. For the second part, mention your findings (the what) and, especially, your conclusion (the so what — that is, the interpretation of your findings); if appropriate, end with perspectives, as in the Conclusion section of your paper.</p>\n<p>Although the structure of the abstract parallels the Introduction and Conclusion sections, it differs from these sections in the audience it addresses. The abstract is read by many different readers, from the most specialized to the least specialized among the target audience. In a sense, it should be the least specialized part of the paper. Any scientist reading it should be able to understand why the work was carried out and why it is important (context and need), what the authors did (task) and what the paper reports about this work (object of the document), what the authors found (findings), what these findings mean (the conclusion), and possibly what the next steps are (perspectives). In contrast, the full paper is typically read by specialists only; its Introduction and Conclusion are more detailed (that is, longer and more specialized) than the abstract.</p>\n<p>An effective abstract stands on its own — it can be understood fully even when made available without the full paper. To this end, avoid referring to figures or the bibliography in the abstract. Also, introduce any acronyms the first time you use them in the abstract (if needed), and do so again in the full paper (see Mechanics: Using abbreviations).</p>\n<hr>\n<h2 id=\"snippet\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#snippet\"></a>Snippet</h2>\n<p>Use the ctno snippet (type ctno and tab or auto complete to have a predefined structure)</p>\n<h1 id=\"title\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#title\"></a>Title</h1>\n<h2 id=\"context-of-the-paperdocnoteparagraph\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#context-of-the-paperdocnoteparagraph\"></a>Context (of the paper/doc/note/paragraph)</h2>\n<p>First, provide some context to orient those readers who are less familiar with your topic and to establish the importance of your work.</p>\n<h2 id=\"need-of-the-paperdocnoteparagraph\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#need-of-the-paperdocnoteparagraph\"></a>Need (of the paper/doc/note/paragraph)</h2>\n<p>Second, state the need for your work, as an opposition between what the scientific community currently has and what it wants.</p>\n<h2 id=\"task-of-the-paperdocnoteparagraph\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#task-of-the-paperdocnoteparagraph\"></a>Task (of the paper/doc/note/paragraph)</h2>\n<p>Third, indicate what you have done in an effort to address the need (this is the task).</p>\n<h2 id=\"object-of-the-paperdocnoteparagraph\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#object-of-the-paperdocnoteparagraph\"></a>Object (of the paper/doc/note/paragraph)</h2>\n<p>Finally, preview the remainder of the paper to mentally prepare readers for its structure, in the object of the document.</p>\n<h1 id=\"title-1\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#title-1\"></a>Title</h1>\n<p>time</p>\n<h2 id=\"context\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#context\"></a>Context</h2>\n<p>First, provide some context to orient you/readers/your grandma who are less familiar with your topic and to establish the importance of this note/paragraph/text/paper/project.</p>\n<h2 id=\"need\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#need\"></a>Need</h2>\n<p>Second, state the need for your note/paragraph/text/paper/project, as an opposition between what you/others/the scientific community/your grandma currently has and what it wants.</p>\n<h2 id=\"task-of-the-noteparagraphtextpaperproject\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#task-of-the-noteparagraphtextpaperproject\"></a>Task (of the note/paragraph/text/paper/project)</h2>\n<p>Third, indicate what you have done in an effort to address the need (this is the task).</p>\n<ul class=\"contains-task-list\">\n<li class=\"task-list-item\"><input type=\"checkbox\" disabled> did this</li>\n<li class=\"task-list-item\"><input type=\"checkbox\" disabled> did that</li>\n<li class=\"task-list-item\"><input type=\"checkbox\" disabled> oh and this also</li>\n</ul>\n<h2 id=\"object-of-the-noteparagraphtextpaperproject\"><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#object-of-the-noteparagraphtextpaperproject\"></a>Object (of the note/paragraph/text/paper/project)</h2>\n<p>Finally, preview the remainder of the paper to mentally prepare you/readers for its structure, in the object of the document.</p>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/commons-dws-public/notes/jw21bshi0z4fd96sselk09w\">2024-03-08</a></li>\n</ul>","noteIndex":{"id":"QvYK9hGbCvPpEfSRYhV8j","title":"Welcome to the COMMONS Lab Open Dendron","desc":"","updated":1693056226815,"created":1630130450048,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"20f67df3dd870fc450a162c202c9ff41","links":[{"type":"wiki","from":{"fname":"root","id":"QvYK9hGbCvPpEfSRYhV8j","vaultName":"vault"},"value":"open-notebook.commons.setup","position":{"start":{"line":43,"column":118,"offset":1871},"end":{"line":43,"column":149,"offset":1902},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"open-notebook.commons.setup"}}],"anchors":{"what-is-this-note":{"type":"header","text":"What is this note","value":"what-is-this-note","line":16,"column":0,"depth":2},"tutorial":{"type":"header","text":"Tutorial","value":"tutorial","line":20,"column":0,"depth":2},"dendron":{"type":"header","text":"Dendron.","value":"dendron","line":22,"column":0,"depth":3},"what-is-dendron-":{"type":"header","text":"What is Dendron ?","value":"what-is-dendron-","line":24,"column":0,"depth":4},"where-to-get-more-info-on-dendron-":{"type":"header","text":"Where to get more info on Dendron ?","value":"where-to-get-more-info-on-dendron-","line":30,"column":0,"depth":4},"concrete-steps-to-access-and-contribute-to-the-dbgi-dendron":{"type":"header","text":"Concrete steps to access and contribute to the DBGI Dendron","value":"concrete-steps-to-access-and-contribute-to-the-dbgi-dendron","line":35,"column":0,"depth":4},"questions-comments-suggestions-":{"type":"header","text":"Questions, comments, suggestions ?","value":"questions-comments-suggestions-","line":52,"column":0,"depth":2}},"children":["5o0tvzf4l6t6moau7en1v48","e4ul30admmxm9ilxfq275cq","h78qbvh1fd9bwcykmcm9uo3","6ooxuf27zzf3grb14o18qf2","tiqo5upbg6224t7i8p87iok","ltq8wcrabmq6mlescrdi4m0","bdq3suiz8yriznljea2zpug","ih6vyup3yre4m9woc9ldl7k","vDTgZL9UHWqYtBFdtD3vK","69ekb2qhuwukr0jwrzy6tnw","8us579vydjfskegndhvdzsl","373694o1o6ocqohko4um7c9","jldFUSJGjDf1mFH8c2yUI","dh2qp7w4tl6otf89xrmxitv","2rvdf4t5qnx5hqjj29bojcc","stj9lq0lxhfuk5ntomiozz0","gvdyfgvq0z08fcfaqzmhtjo","2rvclk21kfedpvxuzjpizi7","dcwgamgyghrlyau1avlh6ug","432qdutuo1i8h5pcuh39ytt","2npxodkvs5jk6p1eksi551b","h81rw16zzgh9kix8ti1mbam","lco50o42dfeph5i5f2k981w","46d1odkovrpdi6g16992phy","sw67lr6069gwhqmdym2l9na","s9gzk7nphtjzmpdqvk5y4vj","82ra6p4ykf814hp8yfw4wp6","hpnaglyhnb48vuiniqecnqf","y7nk7xmiht44neo0q7cl5cs","2cxr093kvrg4jojokwgqrbj","8vfu5h3617jbzy78xr2hlo1","w75krbmkkvla3hwd66hn5bh","40po5od17ekcr1e77dluxao","4pqppog2u66rx1tkc8jy5v9","ektni5nfulyro7dkrbtek7j","vfsp2aci6vy7kg2jsyy8tzu","0wm4geq40t6nscn88rcwu47","ib4jmxy1x3l1r0ewe6hln4j","0h57aw0be2jnc3dxcpn3ajn","4789z8f1dqdh5k3nmgr1m4z","p5dszyuhj1klgje0brtv0xj","sk4m9gq7vz2t9phcxlxvqpw","43p60vv8btyhaclugl93jok","zhc9hhpaobkbo4e2votv6wr","ylulfzi7ra5yv6ja7j78t6e","wj0i9czxvt4v0b674nb8501","ovslc641d0h00s16tf6kl8w","4zmlbmcp6q4q69ycvhavzr6","59ftsVxFXXM9bB43vfKwK","nmnpsy2e1rwqnqgurogi2u6","yi9sq691cas9eyjfx8x7atd","hmn2egle6t4foxe01xup7xt","3yysbx5aor30qd48lqaulbt","nq0iph4a21h5alnuip05j6z","y4t7h534eugai0bjr3mgfjn","zlbfl274tfdx3ix844jt5bm","ulasj276ktykjhdco456wan","au21tj497d981l8pdsily19","8zdzqjzai32lw7xbn30khlt","rjq88ar936t5kn7i86dnfb2","q1yxhdq1jqazej8hq8qzqrb","9mwhjkgi6lx9icrry5qwcg7","3j65st8vcb7mztobso4xk1m","t4z6dnhqmj5axvc2d1esbnn","quvftc4ygczckg0vfltkxbb","jka9lkt701hkbxyfs0qujnx","ivro3wr1xttk7fh7ikp0mvx","alwx9pow583s15xgx2gecjv"],"parent":null,"data":{},"body":"\n![](/assets/images/allard-lab.jpg)\n\nWelcome the the COMMONS Lab Open Dendron !\n\nIn the [COMMONS Lab](https://www.unifr.ch/bio/en/groups/allard/) we intent to follow the [Open Notebook Science](https://en.wikipedia.org/wiki/Open-notebook_science) approach to document our research.\n\nFor this we use the [Dendron](https://www.dendron.so/) system as a mean to efficiently capture notes and publish them.\n\n## What is this note\n\nThis note is a succinct tutorial note aiming to get you started in the use of the COMMONS Lab Dendron.\n\n## Tutorial\n\n### Dendron. \n\n#### What is Dendron ?\n\n> Dendron is an open-source, local-first, markdown-based, note-taking tool. Think of it as a cache for everything that you care about - if you've spent more then five minutes solving a problem, you should never spent any more time solving the same exact problem.\n> \n> Dendron is a knowledge base built by and for developers and integrates natively with IDEs like VS Code and VSCodium.\n\n#### Where to get more info on Dendron ?\n\n- You can get more information in the Dendron system at the official website www.dendron.so\n- All the Dendron documentation is hosted here https://wiki.dendron.so/. It is, obviously, a Dendron itself.\n\n#### Concrete steps to access and contribute to the DBGI Dendron\n\n1. Install [VSCode](https://code.visualstudio.com/download)\n2. Install [Dendron](https://marketplace.visualstudio.com/items?itemName=dendron.dendron) from the VSCode marketplace \n3. Clone the COMMONS Dendron repo\n\n    In your terminal\n    ```\n    git clone https://github.com/commons-research/commons-dws-public.git\n    ```\n4. In VSCode open (File/Open) the cloned repository.\n5. Voila ! You should now be in the COMMONS Lab Open Dendron.\n\nFeel free to explore and contribute.\nA first, important step could be to configure VSCode so that you can easily add a daily note. See steps described at [[open-notebook.commons.setup]]\n\n\n## Questions, comments, suggestions ?\n\nFeel free to contribute here https://github.com/orgs/commons-research/discussions\n\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":false,"leaveTrace":false,"bubbleUpCreateNew":true,"vaultSelectionModeOnCreate":"smart","fuzzThreshold":0.2}},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"randomNote":{},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"maxPreviewsCached":10,"maxNoteLength":204800,"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"enableUserTags":true,"enableHashTags":true,"dendronVersion":"0.112.0","enableEditorDecorations":true,"enableFullHierarchyNoteTitle":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enableMermaid":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enableMermaid":true,"enablePrettyRefs":true,"enableKatex":true,"assetsPrefix":"/commons-dws-public","copyAssets":true,"siteHierarchies":["root"],"enableSiteLastModified":true,"siteRootDir":"docs","siteUrl":"https://commons-research.github.io","enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"writeStubs":false,"seo":{"title":"COMMONS DWS Public","description":"Personal knowledge space"},"github":{"enableEditLink":true,"editLinkText":"Click here to edit this page on Github !","editBranch":"main","editViewMode":"edit","editRepository":"https://github.com/commons-research/commons-dws-public"},"enablePrettyLinks":true,"enableTaskNotes":true,"siteFaviconPath":"favicon.ico","siteIndex":"root","searchMode":"lookup"}}},"__N_SSG":true}